In [ ]:
%reload_ext sql
%sql sqlite://

'Connected: @None'

In [ ]:
%%sql
CREATE TABLE students (
  id INTEGER PRIMARY KEY,
  name TEXT NOT NULL,
  gender TEXT NOT NULL,
  usn varchar,
  branch TEXT NOT NULL,
  course_fee INTEGER NOT NULL
);

 * sqlite://
Done.

[]

In [ ]:
%%sql
INSERT INTO students values (1, 'lichingngamba tensubam', 'male', '21ETCS115004', 'DSE', 500 );
INSERT INTO students values (2, 'jack', 'male', '21dsdd55', 'AI', 750);
INSERT INTO students values (3, 'thoibi', 'female', '21ETC34erf', 'DSE', 600 );
INSERT INTO students values (4, 'Dingnou', 'male', '21Effhja45', 'AI', 800 );
INSERT INTO students values (5, 'liching', 'male', '21ETCS1fdf', 'DSE', 1000 );
INSERT INTO students values (6, 'tensubam', 'male', '21ETCSfhdu', 'AIML', 400 );
INSERT INTO students values (7, 'lic', 'female', '21ETCS1zfdfa', 'DSE', 900);
INSERT INTO students values (8, 'lichi', 'male', '21ETCS1dfew', 'AIML', 600 );
INSERT INTO students values (9, 'lichim', 'male', '21ETCS1fdweq', 'DSE', 400 );
INSERT INTO students values (10, 'lioio', 'female', '21ETCS1sdf', 'AIML', 800 );
INSERT INTO students values (11, 'lokkok', 'male', '21ETCS1dsd', 'AIML', 900 );
INSERT INTO students values (12, 'lingthoi', 'female', '21ETCSffdf4', 'DSE', 500 );
INSERT INTO students values (13, 'lisham', 'female', '21ETCffwe', 'AIML', 500 );
INSERT INTO students values (14, 'djkjsk', 'male', '21ETCS11sdfd', 'DSE', 800 );
INSERT INTO students values (15, 'tomba', 'male', '21ETCS1w343', 'DSE', 700 );
INSERT INTO students values (16, 'namjun', 'male', '21ETCS1ddknjj87', 'AIML', 800 );
INSERT INTO students values (17, 'MR cob', 'male', '21ETCS115ded3', 'DSE', 850);
INSERT INTO students values (18, 'bala', 'female', '21ETCS11d54', 'AIML', 750);
INSERT INTO students values (19, 'gokul', 'male', '21ETCSdwde56', 'AIML', 800 );
INSERT INTO students values (20, 'kaiku', 'male', '21ETCS1dwd577', 'DSE', 900 );
INSERT INTO students values (21, 'susmita', 'female', '21ETCS24drg', 'AIML', 1050 );
INSERT INTO students values (22, 'aliabhat', 'female', '21ETCS1d43', 'AIML',600 );
INSERT INTO students values (23, 'karena kapoor', 'female', '21ETCS1dfe35', 'DSE', 830 );
INSERT INTO students values (24, 'Ram', 'male', '21ETCS13fdfs4', 'DSE', 750 );
INSERT INTO students values (25, 'shita', 'female', '21ETCS45gza', 'AIML', 650 );

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM students

 * sqlite://
Done.

[(1, 'lichingngamba tensubam', 'male', '21ETCS115004', 'DSE', 500),
 (2, 'jack', 'male', '21dsdd55', 'AI', 750),
 (3, 'thoibi', 'female', '21ETC34erf', 'DSE', 600),
 (4, 'Dingnou', 'male', '21Effhja45', 'AI', 800),
 (5, 'liching', 'male', '21ETCS1fdf', 'DSE', 1000),
 (6, 'tensubam', 'male', '21ETCSfhdu', 'AIML', 400),
 (7, 'lic', 'female', '21ETCS1zfdfa', 'DSE', 900),
 (8, 'lichi', 'male', '21ETCS1dfew', 'AIML', 600),
 (9, 'lichim', 'male', '21ETCS1fdweq', 'DSE', 400),
 (10, 'lioio', 'female', '21ETCS1sdf', 'AIML', 800),
 (11, 'lokkok', 'male', '21ETCS1dsd', 'AIML', 900),
 (12, 'lingthoi', 'female', '21ETCSffdf4', 'DSE', 500),
 (13, 'lisham', 'female', '21ETCffwe', 'AIML', 500),
 (14, 'djkjsk', 'male', '21ETCS11sdfd', 'DSE', 800),
 (15, 'tomba', 'male', '21ETCS1w343', 'DSE', 700),
 (16, 'namjun', 'male', '21ETCS1ddknjj87', 'AIML', 800),
 (17, 'MR cob', 'male', '21ETCS115ded3', 'DSE', 850),
 (18, 'bala', 'female', '21ETCS11d54', 'AIML', 750),
 (19, 'gokul', 'male', '21ETCSdwde56', 'AIML', 800),
 (20, 'kaiku', 'male', '21ETCS1dwd577', 'DSE', 900),
 (21, 'susmita', 'female', '21ETCS24drg', 'AIML', 1050),
 (22, 'aliabhat', 'female', '21ETCS1d43', 'AIML', 600),
 (23, 'karena kapoor', 'female', '21ETCS1dfe35', 'DSE', 830),
 (24, 'Ram', 'male', '21ETCS13fdfs4', 'DSE', 750),
 (25, 'shita', 'female', '21ETCS45gza', 'AIML', 650)]

In [ ]:
%%sql

SELECT * FROM students LIMIT 5;

 * sqlite://
Done.

[(1, 'lichingngamba tensubam', 'male', '21ETCS115004', 'DSE', 500),
 (2, 'jack', 'male', '21dsdd55', 'AI', 750),
 (3, 'thoibi', 'female', '21ETC34erf', 'DSE', 600),
 (4, 'Dingnou', 'male', '21Effhja45', 'AI', 800),
 (5, 'liching', 'male', '21ETCS1fdf', 'DSE', 1000)]

In [ ]:
%%sql

SELECT DISTINCT gender FROM students;

 * sqlite://
Done.

[('male',), ('female',)]

In [ ]:
%%sql

SELECT * FROM students WHERE name='lisham';

 * sqlite://
Done.

[(13, 'lisham', 'female', '21ETCffwe', 'AIML', 500)]

In [ ]:
%%sql

SELECT * FROM students ORDER BY id DESC LIMIT 5;

 * sqlite://
Done.

[(25, 'shita', 'female', '21ETCS45gza', 'AIML', 650),
 (24, 'Ram', 'male', '21ETCS13fdfs4', 'DSE', 750),
 (23, 'karena kapoor', 'female', '21ETCS1dfe35', 'DSE', 830),
 (22, 'aliabhat', 'female', '21ETCS1d43', 'AIML', 600),
 (21, 'susmita', 'female', '21ETCS24drg', 'AIML', 1050)]

In [ ]:
%%sql

SELECT name AS std_name, gender AS sex FROM students limit 6;

 * sqlite://
Done.

[('lichingngamba tensubam', 'male'),
 ('jack', 'male'),
 ('thoibi', 'female'),
 ('Dingnou', 'male'),
 ('liching', 'male'),
 ('tensubam', 'male')]

In [ ]:
%%sql

SELECT branch, Count(*) FROM students GROUP BY branch;

 * sqlite://
Done.

[('AI', 2), ('AIML', 11), ('DSE', 12)]

In [ ]:
%%sql

SELECT AVG(course_fee) FROM students;

 * sqlite://
Done.

[(725.2,)]

In [ ]:
%%sql

SELECT COUNT(*) FROM students;

 * sqlite://
Done.

[(25,)]

In [ ]:
%%sql

SELECT COUNT ( DISTINCT branch ) FROM students;

 * sqlite://
Done.

[(3,)]

In [ ]:
%%sql

SELECT SUM(course_fee) FROM students;

 * sqlite://
Done.

[(18130,)]

In [ ]:
%%sql

SELECT MIN(course_fee) AS lowest_course_fee FROM students;

 * sqlite://
Done.

[(400,)]

In [ ]:
%%sql

SELECT MAX(course_fee) AS higest_course_fee FROM students;

 * sqlite://
Done.

[(1050,)]

In [ ]:
%%sql

SELECT branch, Count(*) FROM students GROUP BY branch HAVING COUNT(branch) > 10;

 * sqlite://
Done.

[('AIML', 11), ('DSE', 12)]

10.2 PFDS
 Create another table with minimum 2 columns (parameters) and perform the below operations:

Combining Data: JOIN (LEFT, INNER, OUTER, RIGHT), UNION

In [ ]:
%%sql

create table profile(
  id INTEGER,
  place TEXT NOT NULL
)

 * sqlite://
Done.

[]

In [ ]:
%%sql

insert into profile values (1, 'manipur');
insert into profile values (2, 'bangalore');
insert into profile values (3, 'kerela');
insert into profile values (4, 'tamil_nadu');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

select * from profile;

 * sqlite://
Done.

[(1, 'manipur'), (2, 'bangalore'), (3, 'kerela'), (4, 'tamil_nadu')]

In [ ]:
%%sql
#left join

SELECT name, profile.place
FROM students
LEFT JOIN profile
ON students.id = profile.id LIMIT 9;

 * sqlite://
Done.

[('lichingngamba tensubam', 'manipur'),
 ('jack', 'bangalore'),
 ('thoibi', 'kerela'),
 ('Dingnou', 'tamil_nadu'),
 ('liching', None),
 ('tensubam', None),
 ('lic', None),
 ('lichi', None),
 ('lichim', None)]

In [ ]:
%%sql
#inner join

SELECT name, profile.place
FROM students
INNER JOIN profile
ON students.id = profile.id;

 * sqlite://
Done.

[('lichingngamba tensubam', 'manipur'),
 ('jack', 'bangalore'),
 ('thoibi', 'kerela'),
 ('Dingnou', 'tamil_nadu')]

In [ ]:
%%sql
#right join

SELECT place, students.name
FROM profile
LEFT JOIN students
ON students.id = profile.id;

 * sqlite://
Done.

[('manipur', 'lichingngamba tensubam'),
 ('bangalore', 'jack'),
 ('kerela', 'thoibi'),
 ('tamil_nadu', 'Dingnou')]

In [ ]:
%%sql
#union

SELECT name FROM students
UNION
SELECT place FROM profile;

 * sqlite://
Done.

[('Dingnou',),
 ('MR cob',),
 ('Ram',),
 ('aliabhat',),
 ('bala',),
 ('bangalore',),
 ('djkjsk',),
 ('gokul',),
 ('jack',),
 ('kaiku',),
 ('karena kapoor',),
 ('kerela',),
 ('lic',),
 ('lichi',),
 ('lichim',),
 ('liching',),
 ('lichingngamba tensubam',),
 ('lingthoi',),
 ('lioio',),
 ('lisham',),
 ('lokkok',),
 ('manipur',),
 ('namjun',),
 ('shita',),
 ('susmita',),
 ('tamil_nadu',),
 ('tensubam',),
 ('thoibi',),
 ('tomba',)]

In [ ]:
#outerjoin
%%sql

SELECT name, profile.place
FROM students
JOIN profile
ON students.id = profile.id;

 * sqlite://
Done.

[('lichingngamba tensubam', 'manipur'),
 ('jack', 'bangalore'),
 ('thoibi', 'kerela'),
 ('Dingnou', 'tamil_nadu')]